
// Во всех заданиях(если нет уточнений) входные и выходные данные хранятся в текстовом файле.
// Программы берут имена входных и выходных файлов из командной строки.
// Необходимо использовать STL контейнеры

// Реализовать алгоритм Хаффмана. Дерево должно передаваться эффективно.
// Программа должна уметь архивировать и разархивировать одиночные файлы.

#include <iostream>

int main(int argc, char* argv[]) {
	if (!argv[1])
		std::cout << "\n Usage: ";
	return 0;
}